//
// Created by Zhou Zhicheng on 2021/2/23.
// Transplant from Keil version
//

/*******************************************************************
版权声明：       HITCRT-iHiter(哈工大竞技机器队RoboMaster iHiter战队)
文件名：         rm_rc_types.h
最近修改日期：    2021.2.23
版本：           v2.0
--------------------------------------------------------------------
模块描述：       该模块说明了遥控接收系统的相关参数和定义了相关结构体。
--------------------------------------------------------------------
修改记录：
作者         时间            版本         说明
FengYun     2015.12.24      1.0         建立此文件
Tony		2021.2.23		2.0			移植为Clion版本，将裁判系统分离
********************************************************************/

#ifndef RM_RC_TYPES_H
#define RM_RC_TYPES_H

#include "rm_redefine_types.h"

/********************遥控接收系统规格参数*********************
*DJI DESSET 2.4G遥控接收系统   工作频率           2.4GHz ISM
*                              通信距离(开阔室外)   1km
*----------------------------------------------------------
*DT7遥控器                     特性                7通道
*                              工作电流/电压       120mA@3.7V
*                              电池          3.7V2000mA锂电池
*----------------------------------------------------------
*DR16接收机                    特性          2.4GHz D-Bus协议
*                              接收灵敏度(1%PER)   -97dBm
*                              工作电流/电压       145mA@5V
*                              电源                4-8.4V
*                              尺寸             41mm*29mm*5mm
*                              重量                 10g
************************************************************/


/************************接收机DR16***************************
*遥控器接收机输出信号为标准DBUS协议数据，当接收机和发射机建立			*
*连接后，接收机便会每隔7ms通过DBus发送一帧数据（18字节）    		*
*                                                           *
*DBus通信参数如下：                                          	*
*                                                          	*
*DBus参数            	数值                                	*
*波特率             		100Kbps                             *
*单元数据长度         	8                                   *
*奇偶校验位         		偶校验                              	*
*结束位               	1                                  	*
*流控                 	无                                 	*
************************************************************/


/*************************发射机DT7***************************
*                                                        	*
*   -----------------------------------------------------	*
*   |    ↑(上-1)                               ↑(上-1)   |	*
*   |SW_L|(中-3)                           SW_R|(中-3)   |	*
*   |    ↓(下-2)                               ↓(下-2)   |	*
*   |                                                   |	*
*   |                                                   |   *
*   |    | ^ |                                | ^ |     |   *
*   |    |   |左摇杆                    右摇杆|   |     |   *
*   |    |   |                                |   |     |   *
*   | ---     ---                          ---     ---  |   *
*   |<           2>                       <           0>|   *
*   | ---     ---                          ---     ---  |   *
*   |    |   |                                |   |     |   *
*   |    |   |                                |   |     |   *
*   |    | 3 |                                | 1 |     |   *
*   |                                                   |   *
*   -----------------------------------------------------   *
*                                                           *
**************************遥控器信息***************************
*域			通道0	通道1	通道2	通道3	S1	S2			*
*偏移        0		11      22      33  	44  46    		*
*长度（bit）	11		11      11      11     	2   2     		*
*符号位      无     	无      无       无     	无  无     		*
*范围           	***********最大值1684*********    *最大值3* 	*
*             	*          中间值1024        *    *最小值1*  	*
*               ***********最小值364**********               *
*功能                                       	1:上   1:上   	*
*                                           2:下   2:下   	*
*                                           3:中   3:中  	*
*                                                           *
***************************鼠标信息***************************
*域         鼠标x轴	鼠标y轴	鼠标z轴	鼠标左键	鼠标右键			*
*偏移		48		64		80		86		94				*
*长度		16		16		16		8		8				*
*符号位		有		有 		有 		无		无   			*
*范围         	******最大值32767*****         ***最大值1***	*
*             	*     最小值-32768   *         ***最小值0***	*
*             	******静止值0*********                    	*
*功能       	***鼠标在XYZ轴的移动速度***   	*鼠标左右键是否按下*	*
*           *  负值标识往左移动       *   	*    0:没按下    *  	*
*           ***正值标识往右移动********   	*****1:按下*******	*
*                                                        	*
*                                                         	*
***************************键盘信息***************************
*域				按键                                      	*
*偏移            102                                        	*
*长度            16                                        	*
*符号位          无                                        	*
*范围         	位值标识                                 	*
*功能        	每个按键对应一个bit                            *
*        		Bit0:W键                                   	*
*          		Bit1:S键                                 	*
*         		Bit2:A键                                  	*
*               Bit3:D键                                 	*
*               Bit4:Shift键                             	*
*               Bit5:Ctrl键                               	*
*               Bit6:Q键                                	*
*               Bit7:E键                                  	*
*************************************************************/

#define RC_CH_VALUE_MIN             ((USHORT16)364)
#define RC_CH_VALUE_OFFSET          ((USHORT16)1024)
#define RC_CH_VALUE_MAX             ((USHORT16)1684)
#define RC_CH_VALUE_DEAD            ((USHORT16)20)
#define RC_CH_VALUE_RANGE           ((USHORT16)660)

#define RC_SW_UP                    ((UCHAR8)1)
#define RC_SW_MID                   ((UCHAR8)3)
#define RC_SW_DOWN                  ((UCHAR8)2)

#define KEY_PRESSED_OFFSET_W        ((u16)0x01<<0)
#define KEY_PRESSED_OFFSET_S        ((u16)0x01<<1)
#define KEY_PRESSED_OFFSET_A        ((u16)0x01<<2)
#define KEY_PRESSED_OFFSET_D        ((u16)0x01<<3)
#define KEY_PRESSED_OFFSET_SHIFT    ((u16)0x01<<4)
#define KEY_PRESSED_OFFSET_CTRL     ((u16)0x01<<5)
#define KEY_PRESSED_OFFSET_Q        ((u16)0x01<<6)
#define KEY_PRESSED_OFFSET_E        ((u16)0x01<<7)
#define KEY_PRESSED_OFFSET_R        ((u16)0x01<<8)
#define KEY_PRESSED_OFFSET_F        ((u16)0x01<<9)
#define KEY_PRESSED_OFFSET_G        ((u16)0x01<<10)
#define KEY_PRESSED_OFFSET_Z        ((u16)0x01<<11)
#define KEY_PRESSED_OFFSET_X        ((u16)0x01<<12)
#define KEY_PRESSED_OFFSET_C        ((u16)0x01<<13)
#define KEY_PRESSED_OFFSET_V        ((u16)0x01<<14)
#define KEY_PRESSED_OFFSET_B        ((u16)0x01<<15)

/** 遥控器数据结构体 */
typedef struct {
	USHORT16 Ch0;
	USHORT16 Ch1;
	USHORT16 Ch2;
	USHORT16 Ch3;
	USHORT16 Ch4;
	UCHAR8 SW_L;
	UCHAR8 SW_R;
} ST_RC;

/** 鼠标数据结构体 */
typedef struct {
	s16 X;
	s16 Y;
	s16 Z;
	u8 Left;
	u8 Right;
} ST_MOUSE;

/** 接收DR16 18字节数据的结构体 */
typedef struct {
	ST_RC stRC;
	ST_MOUSE stMouse;
	u16 usKeyboard;
} ST_DBUS;

#endif //HAL_CHASSIS_RM_RC_TYPES_H


